#+startup: overview
** Color
#+BEGIN_SRC emacs-lisp
;; (add-hook! 'org-mode-hook (rainbow-mode))
;; (add-hook! 'prog-mode-hook (rainbow-mode))
;; (add-hook! 'text-mode-hook (rainbow-mode))
(add-hook! 'rainbow-mode-hook
  (hl-line-mode (if rainbow-mode -1 +1)))
#+END_SRC

#+RESULTS:
| lambda | (&rest _) | (hl-line-mode (if rainbow-mode -1 1)) |

